package com.ashlikun.libarouter.constant;

/**
 * 作者　　: 李坤
 * 创建时间:2017/8/8 0008　21:18
 * 邮箱　　：496546144@qq.com
 * <p>
 * 功能介绍：Arouter用到的参数key标识
 */

public interface ARouterWith {
    /********************************************************************************************
     *                                           Intent  Flag   int
     ********************************************************************************************/
    String FLAG_TYPE = "FLAG_TYPE";//int
    String FLAG_ID = "FLAG_ID";//int
    String FLAG_USER_ID = "FLAG_USER_ID";//int
    /********************************************************************************************
     *                                           Intent  Flag   boolean
     ********************************************************************************************/
    String FLAG_IS_MULTI = "FLAG_IS_MULTI";//是否是多选
    /********************************************************************************************
     *                                           Intent  Flag   String
     ********************************************************************************************/
    String FLAG_TITLE = "FLAG_TITLE";//String
    String FLAG_URL = "FLAG_URL";//String
    String FLAG_SUB_TITLE = "FLAG_SUB_TITLE";//String
    /********************************************************************************************
     *                                           Intent Flag   object
     ********************************************************************************************/
    String FLAG_DATA = "FLAG_DATA";//object
}
